// Объявите пустой массив, а затем заполните его числами от 1 до 10.

// let arr =[];

// for(let i = 0, j = 1; j <= 10; i++, j++) {
//     arr[i] = j; 
// }
// console.log(arr);

// Объявите пустой массив, а затем заполните его 5-ю буквами x.

// let arr = [];

// for(let i = 0; i < 5; i++) {
//     arr[i] = 'x';
// }
// console.log(arr);



// С помощью цикла заполните массив числами от 1 до 100.

// let arr = [];

// for(let i = 0; i <= 100; i++) {
//     arr[i] = i + 1;
// }
// console.log(arr);

// let arr =[];

// for (let i = 2, j =0; i <=100; i += 2, j++) {
//     arr[j] = i;
// }
// console.log(arr);

// С помощью цикла заполните массив нечетными числами в промежутке от 1 до 99.

// let arr = [];

// for( let i = 1, j = 0; i <= 100; i += 2, j++) {
//     arr [j] = i;
// }
// console.log(arr);