// 83 of 312

// Дан массив с числами. Переберите этот массив циклом и возведите каждый элемент этого массива в квадрат.

// let arr = [1, 4, 56, 3, 21, 89];

// for( let i = 0; i < arr.length; i++) {
//     arr[i] = arr[i] ** 2;
// }

// console.log(arr);

// Дан массив с числами. Переберите этот массив циклом и отнимите от каждого элемента единицу.

// let arr = [3, 9, 4, 1, 65];

// for (let i = 0; i < arr.length; i++) {
//     arr[i] -= 1;
// }

// console.log(arr);

// Дан массив с числами. Переберите этот массив циклом и прибавьте к каждому элементу 10.

let arr = [1, 3, 5, 6, 64, 33];

for (let i = 0; i < arr.length; i++) {
    arr [i] *= 10;
}

console.log(arr);