// Задача 6⋕js.Pm.Lp.APF.6

// Автор следующего кода хотел создать массив вида ['a', 'b', 'c']:

// arr.push('a');
// arr.push('b');
// arr.push('c');
// Написанный код, однако, выдает ошибку в консоль. Исправьте ошибку автора.

// let arr = [];

// arr.push('a');
// arr.push('b');
// arr.push('c');

// console.log(arr);

// Автор следующего кода хотел создать заполнить массив числами от 1 до 5:

// for (let i = 1; i <= 5; i++) {
// 	arr.push(i);
// }

// console.log(arr);
// Написанный код, однако, выдает ошибку в консоль. Исправьте ошибку автора.

// let arr = [];
// for (let i = 1; i <=5; i++) {
//     arr.push(i);
// }
// console.log(arr);

// Автор следующего кода хотел записать в новый массив только нечетные элементы старого массива:

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];

// for (let elem of arr) {
// 	if (elem % 2 != 0) {
// 		result.push(elem);
// 	}
// }

// console.log(result);
// Написанный код, однако, выдает ошибку в консоль. Исправьте ошибку автора.

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
// let result = [];

// for (let elem of arr){
//     if (elem % 2 !== 0) {
//         result.push(elem);
//     } 
// }
// console.log(result);